In [1]:
import pandas as pd

In [6]:
a = {
    'author_id': [1, 2, 3],
    'autor_name': ['Тургенев', 'Чехов', 'Островский']
}

In [8]:
authors = pd.DataFrame(a)
authors

   author_id  autor_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [9]:
b = {
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price': [450, 300, 350, 500, 450, 370, 290]
}
book = pd.DataFrame(b)
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [80]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'outer')

In [81]:
authors_price

   author_id  autor_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [50]:
top5 = authors_price.nlargest(5, 'price')

In [67]:
top5

   author_id  autor_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [132]:
authors_stat = pd.DataFrame({
    'autor_name': authors_price['autor_name'],
    'min_price': authors_price['price'].min(),
    'max_price': authors_price['price'].max(),
    'mean_price': authors_price['price'].mean(),

}, index = [0])

In [133]:
authors_stat

  autor_name  min_price  max_price  mean_price
0   Тургенев        290        500  387.142857